In [5]:
import pandas as pd
data=[10,20,30,40,50]
s1=pd.Series(data)
print(s1)
s2=pd.Series(data,index=['one','two','three','four','five'])
print(s2)

0    10
1    20
2    30
3    40
4    50
dtype: int64
one      10
two      20
three    30
four     40
five     50
dtype: int64

In [10]:
greater=s2>25
print("before:\n",greater )
s3=s2[greater]
print("after:",s3)

before:
 one      False
two      False
three     True
four      True
five      True
dtype: bool
after: three    30
four     40
five     50
dtype: int64

In [11]:
import numpy as np
s4=np.sqrt(s2)
print(s4)

one      3.162278
two      4.472136
three    5.477226
four     6.324555
five     7.071068
dtype: float64

In [13]:
data={
    "calories":[456,789,345,565],
    "duration":[56,34,45,54]
}
df=pd.DataFrame(data)
print(df)

   calories  duration
0       456        56
1       789        34
2       345        45
3       565        54

In [15]:
data1={
    "year":['2000','2001','2002','2003'],
    "state":['ohio','ohio','nevada','ohio'],
    "pop":[1.5,1.7,1.8,2.8]
}
frame=pd.DataFrame(data1)
print(frame)

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002  nevada  1.8
3  2003    ohio  2.8

In [16]:
frame1=pd.DataFrame(data1,index=['one','two','three','four'])
print(frame1)

       year   state  pop
one    2000    ohio  1.5
two    2001    ohio  1.7
three  2002  nevada  1.8
four   2003    ohio  2.8

In [17]:
frame1=pd.DataFrame(data1,columns=['state','year','pop'])
print(frame1)

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2  nevada  2002  1.8
3    ohio  2003  2.8

In [22]:
frame2=pd.DataFrame(data1, columns=['year','state','pop','debt'])
print(frame2)

   year   state  pop debt
0  2000    ohio  1.5  NaN
1  2001    ohio  1.7  NaN
2  2002  nevada  1.8  NaN
3  2003    ohio  2.8  NaN

In [27]:
print(frame2['year'])
print(frame2['debt'])

0    2000
1    2001
2    2002
3    2003
Name: year, dtype: object
0    NaN
1    NaN
2    NaN
3    NaN
Name: debt, dtype: object

In [34]:
print(frame2.loc[[2,3,1]])

   year   state  pop debt
2  2002  nevada  1.8  NaN
3  2003    ohio  2.8  NaN
1  2001    ohio  1.7  NaN

In [35]:
frame2['debt']=12.1
print(frame2)

   year   state  pop  debt
0  2000    ohio  1.5  12.1
1  2001    ohio  1.7  12.1
2  2002  nevada  1.8  12.1
3  2003    ohio  2.8  12.1

In [41]:
import numpy as np
frame2['debt']=np.arange(4.)
print(frame2)

   year   state  pop  debt
0  2000    ohio  1.5   0.0
1  2001    ohio  1.7   1.0
2  2002  nevada  1.8   2.0
3  2003    ohio  2.8   3.0

In [47]:
value=pd.Series([1.2,3.4],index=[1,3])
frame2['debt']=value

print(frame2)

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.7   1.2
2  2002  nevada  1.8   NaN
3  2003    ohio  2.8   3.4

In [49]:
frame2['T/F']=frame2['year']>='2002'
print(frame2)

   year   state  pop  debt  true or false
0  2000    ohio  1.5   NaN          False
1  2001    ohio  1.7   1.2          False
2  2002  nevada  1.8   NaN           True
3  2003    ohio  2.8   3.4           True

In [53]:
print(frame2.T)

          0     1       2     3
year   2000  2001    2002  2003
state  ohio  ohio  nevada  ohio
pop     1.5   1.7     1.8   2.8
debt    NaN   1.2     NaN   3.4

In [55]:
obj=pd.Series([4.5,6.4,3.4],index=['a','f','e'])
print(obj)

a    4.5
f    6.4
e    3.4
dtype: float64

In [59]:
obj2=obj.reindex(['a','b','c','d','f'])
print(obj2)

a    4.5
b    NaN
c    NaN
d    NaN
f    6.4
dtype: float64

In [61]:
new=obj2.drop(['a'])
print(new)

b    NaN
c    NaN
d    NaN
f    6.4
dtype: float64

In [75]:
data=pd.DataFrame(np.arange(35).reshape((5,7)),columns=['sunday','monday','tuesday','wednesday','thursday','friday','saturday'],index=['one week','two week','third week','fourth week','fifth week'])
print(data)

             sunday  monday  tuesday  wednesday  thursday  friday  saturday
one week          0       1        2          3         4       5         6
two week          7       8        9         10        11      12        13
third week       14      15       16         17        18      19        20
fourth week      21      22       23         24        25      26        27
fifth week       28      29       30         31        32      33        34

In [73]:
data.drop(['one week','fourth week'])

            sunday  monday  tuesday  wednesday  thursday  friday  saturday
two week         7       8        9         10        11      12        13
third week      14      15       16         17        18      19        20
fifth week      28      29       30         31        32      33        34

In [77]:
data['sunday']

one week        0
two week        7
third week     14
fourth week    21
fifth week     28
Name: sunday, dtype: int64

In [81]:
data1=pd.DataFrame({'A':[1,2,3],'B':[2,4,6]})
data2=pd.DataFrame({'A':[5,3,6],'B':[6,8,3]})
print("ADDITION:\n",data1+data2)
print("SUBTRACTION:\n",data1-data2)
print("MULTIPLICATION:\n",data1*data2)
print("DIVISION:\n",data1/data2)

ADDITION:
    A   B
0  6   8
1  5  12
2  9   9
SUBTRACTION:
    A  B
0 -4 -4
1 -1 -4
2 -3  3
MULTIPLICATION:
     A   B
0   5  12
1   6  32
2  18  18
DIVISION:
           A         B
0  0.200000  0.333333
1  0.666667  0.500000
2  0.500000  2.000000